STM32World/stlink/src/stlink-lib/usb.c
/*
 * File: usb.c
 *
 * USB commands & interaction with ST-LINK devices
 */

#if !defined(_MSC_VER)
#include <sys/time.h>
#endif // _MSC_VER

#if defined(_WIN32)
#include <win32_socket.h>
#endif // _WIN32

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <errno.h>
#include <limits.h>
#include <stdbool.h>
#include <unistd.h>

#include <stlink.h>
#include <stlink_backend.h>
#include <stlink_cmd.h>
#include <stm32_register.h>

#include "logging.h"
#include "read_write.h"
#include "usb.h"

#define STLINK_MEM_AP_CSW_CORTEX_M 0x23000000u
static int32_t _stlink_usb_init_ap(stlink_t *sl);

static bool stlink_h5_is_verify_read(const stlink_t *sl, uint32_t addr, uint16_t chunk) {
    /*
     * H5 verify uses 1 KiB flash reads over AP1. Skip per-block
     * GETLASTRWSTATUS2 so the verify loop stays read-only.
     */
    return stlink_h5_uses_ap(sl) &&
           sl->flash_size != 0 &&
           chunk >= 1024 &&
           addr >= sl->flash_base &&
           addr < (sl->flash_base + sl->flash_size);
}

static void stlink_fill_enter_swd_ap_args(const stlink_t *sl, unsigned char *cmd, int32_t offset) {
    if(!stlink_target_uses_ap(sl)) {
        return;
    }

    memset(&cmd[offset], 0xff, 6);
}

static void stlink_fill_init_ap_args(const stlink_t *sl, unsigned char *cmd, int32_t offset) {
    if(!stlink_target_uses_ap(sl)) {
        return;
    }

    cmd[offset] = 0x01;
}

static void stlink_fill_native_ap_tail(const stlink_t *sl, unsigned char *cmd, int32_t offset) {
    if(!stlink_target_uses_ap(sl)) {
        return;
    }

    cmd[offset] = sl->target_ap;
}

static inline uint32_t stlink_mem_ap_csw(const stlink_t *sl) {
    return sl->target_ap == 0 ? 0 : STLINK_MEM_AP_CSW_CORTEX_M;
}

static inline void stlink_set_mem_ap_trailer(unsigned char *cmd, int32_t offset,
                                             const stlink_t *sl) {
    const uint32_t csw = stlink_mem_ap_csw(sl) >> 8;
    cmd[offset] = sl->target_ap;
    cmd[offset + 1] = csw & 0xff;
    cmd[offset + 2] = (csw >> 8) & 0xff;
    cmd[offset + 3] = (csw >> 16) & 0xff;
}

static inline uint16_t stlink_mem32_chunk_size(const stlink_t *sl, uint32_t addr,
                                               uint16_t len, uint16_t max_chunk) {
    uint16_t chunk = len > max_chunk ? max_chunk : len;

    if(stlink_target_uses_ap(sl)) {
        uint16_t boundary = (uint16_t) (1024u - (addr & 0x3ffu));
        if(boundary != 0 && chunk > boundary) {
            chunk = boundary;
        }
    }

    return chunk;
}

static inline bool stlink_use_debug_access_router(const stlink_t *sl) {
    return stlink_target_uses_ap(sl);
}

static inline uint32_t le_to_h_u32(const uint8_t* buf) {
    return ((uint32_t) ((uint32_t) buf[0] | (uint32_t) buf[1] << 8 | (uint32_t) buf[2] << 16 | (uint32_t) buf[3] << 24));
}

static int32_t _stlink_match_speed_map(const uint32_t *map, uint32_t map_size, uint32_t khz) {
    uint32_t i;
    int32_t speed_index = -1;
    int32_t speed_diff = INT_MAX;
    int32_t last_valid_speed = -1;
    bool match = true;

    for(i = 0; i < map_size; i++) {
        if(!map[i]) { continue; }

        last_valid_speed = i;

        if(khz == map[i]) {
            speed_index = i;
            break;
        } else {
            int32_t current_diff = khz - map[i];
            // get abs value for comparison
            current_diff = (current_diff > 0) ? current_diff : -current_diff;

            if(current_diff < speed_diff) {
                speed_diff = current_diff;
                speed_index = i;
            }
        }
    }

    if(speed_index == -1) {
        // This will only be here if we cannot match the slow speed.
        // Use the slowest speed we support.
        speed_index = last_valid_speed;
        match = false;
    } else if(i == map_size) {
        match = false;
    }

    if(!match) {
        ILOG("Unable to match requested speed %d kHz, using %d kHz\n", khz, map[speed_index]);
    }

    return (speed_index);
}

void _stlink_usb_close(stlink_t* sl) {
    if(!sl) { return; }

    struct stlink_libusb * const handle = sl->backend_data;

    // maybe we couldn't even get the usb device?
    if(handle != NULL) {
        if(handle->usb_handle != NULL) { libusb_close(handle->usb_handle); }
        libusb_exit(handle->libusb_ctx);
        free(handle);
    }
}

ssize_t send_recv(struct stlink_libusb* handle, int32_t terminate, unsigned char* txbuf, uint32_t txsize,
                    unsigned char* rxbuf, uint32_t rxsize, int32_t check_error, const char *cmd) {
    // Note: txbuf and rxbuf can point to the same area
    int32_t res, t, retry = 0;

    while (1) {
        res = 0;
        t = libusb_bulk_transfer(handle->usb_handle, handle->ep_req, txbuf, (int32_t) txsize, &res, 3000);

        if(t) {
            ELOG("%s send request failed: %s\n", cmd, libusb_error_name(t));
            return (-1);
        } else if((size_t) res != txsize) {
            ELOG("%s send request wrote %u bytes, instead of %u\n", cmd, (uint32_t) res, (uint32_t) txsize);
        }

        if(rxsize != 0) {
            t = libusb_bulk_transfer(handle->usb_handle, handle->ep_rep, rxbuf, (int32_t) rxsize, &res, 3000);

            if(t) {
                ELOG("%s read reply failed: %s\n", cmd, libusb_error_name(t));
                return (-1);
            }
            /* Checking the command execution status stored in the first byte of the response */
            if(handle->protocol != 1 && check_error >= CMD_CHECK_STATUS && 
                        rxbuf[0] != STLINK_DEBUG_ERR_OK) {
                switch(rxbuf[0]) {
                case STLINK_DEBUG_ERR_AP_WAIT:
                case STLINK_DEBUG_ERR_DP_WAIT:
                    if(check_error == CMD_CHECK_RETRY && retry < 3) {
                        uint32_t delay_us = (1 << retry) * 1000;
                        DLOG("%s wait error (0x%02X), delaying %u us and retry\n", cmd, rxbuf[0], delay_us);
                        usleep(delay_us);
                        retry++;
                        continue;
                    }
                    DLOG("%s wait error (0x%02X)\n", cmd, rxbuf[0]);
                    break;
                case STLINK_DEBUG_ERR_FAULT: DLOG("%s response fault\n", cmd); break;
                case STLINK_DEBUG_ERR_AP_FAULT: DLOG("%s access port fault\n", cmd); break;
                case STLINK_DEBUG_ERR_DP_FAULT: DLOG("%s debug port fault\n", cmd); break;
                case STLINK_DEBUG_ERR_AP_ERROR: DLOG("%s access port error\n", cmd); break;
                case STLINK_DEBUG_ERR_DP_ERROR: DLOG("%s debug port error\n", cmd); break;
                case STLINK_DEBUG_ERR_WRITE_VERIFY:  DLOG("%s verification error\n", cmd); break;
                case STLINK_DEBUG_ERR_WRITE:  DLOG("%s write error\n", cmd); break;
                default: DLOG("%s error (0x%02X)\n", cmd, rxbuf[0]); break;
                }

                return (-1);
            }

