STM32World/stlink/src/stlink-lib/usb.c
            if(check_error == CMD_CHECK_REP_LEN && res != (int32_t) rxsize) {
                ELOG("%s wrong reply length\n", cmd);
                res = -1;
            }
        }

        if((handle->protocol == 1) && terminate) {
            // read the SG reply
            unsigned char sg_buf[13];
            t = libusb_bulk_transfer(handle->usb_handle, handle->ep_rep, sg_buf, 13, &res, 3000);

            if(t) {
                ELOG("%s read storage failed: %s\n", cmd, libusb_error_name(t));
                return (-1);
            }

            // The STLink doesn't seem to evaluate the sequence number.
            handle->sg_transfer_idx++;
        }
        return (res);
    }
}

static inline int32_t send_only(struct stlink_libusb* handle, int32_t terminate, unsigned char* txbuf,
                                uint32_t txsize, const char *cmd) {
    return ((int32_t) send_recv(handle, terminate, txbuf, txsize, NULL, 0, CMD_CHECK_NO, cmd));
}


static int32_t fill_command(stlink_t * sl, enum SCSI_Generic_Direction dir, uint32_t len) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd = sl->c_buf;
    int32_t i = 0;
    memset(cmd, 0, sizeof(sl->c_buf));

    if(slu->protocol == 1) {
        cmd[i++] = 'U';
        cmd[i++] = 'S';
        cmd[i++] = 'B';
        cmd[i++] = 'C';
        write_uint32(&cmd[i], slu->sg_transfer_idx);
        write_uint32(&cmd[i + 4], len);
        i += 8;
        cmd[i++] = (dir == SG_DXFER_FROM_DEV) ? 0x80 : 0;
        cmd[i++] = 0;   // logical unit
        cmd[i++] = 0xa; // command length
    }
    return (i);
}

int32_t _stlink_usb_version(stlink_t *sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    uint32_t rep_len;
    int32_t i;

    if(sl->version.stlink_v == 3) {
        // STLINK-V3 version is determined by another command 
        rep_len = 12;
        i = fill_command(sl, SG_DXFER_FROM_DEV, 16);
        cmd[i++] = STLINK_GET_VERSION_APIV3;
    } else {
        rep_len = 6;
        i = fill_command(sl, SG_DXFER_FROM_DEV, 6);
        cmd[i++] = STLINK_GET_VERSION;
    }

    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_REP_LEN, "GET_VERSION");

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_target_voltage(stlink_t *sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const rdata = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    uint32_t rep_len = 8;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);
    uint32_t factor, reading;
    int32_t voltage;

    cmd[i++] = STLINK_GET_TARGET_VOLTAGE;

    size = send_recv(slu, 1, cmd, slu->cmd_len, rdata, rep_len, CMD_CHECK_REP_LEN, "GET_TARGET_VOLTAGE");

    if(size < 0) {
        return (-1);
    }

    factor = (rdata[3] << 24) | (rdata[2] << 16) | (rdata[1] << 8) | (rdata[0] << 0);
    reading = (rdata[7] << 24) | (rdata[6] << 16) | (rdata[5] << 8) | (rdata[4] << 0);
    DLOG("target voltage factor=%08x reading=%08x\n", factor, reading);
    if(factor != 0 && reading != 0) {
        voltage = 2400 * reading / factor;
    } else {
        DLOG("voltage reading failed at device side, bad STLink chip?\n");
        voltage = 0;
    }

    return (voltage);
}

int32_t _stlink_usb_read_debug32(stlink_t *sl, uint32_t addr, uint32_t *data) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const rdata = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    const int32_t rep_len = 8;
    int32_t i;

    if(_stlink_usb_init_ap(sl) == -1) {
        return (-1);
    }

    i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);
    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_APIV2_READDEBUGREG;
    write_uint32(&cmd[i], addr);
    stlink_fill_native_ap_tail(sl, cmd, i + 4);
    size = send_recv(slu, 1, cmd, slu->cmd_len, rdata, rep_len, CMD_CHECK_RETRY, "READDEBUGREG");

    if(size < 0) {
        return (-1);
    }

    *data = read_uint32(rdata, 4);
    return (0);
}

int32_t _stlink_usb_write_debug32(stlink_t *sl, uint32_t addr, uint32_t data) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const rdata = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    const int32_t rep_len = 2;
    int32_t i;

    if(_stlink_usb_init_ap(sl) == -1) {
        return (-1);
    }

    i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);
    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_APIV2_WRITEDEBUGREG;
    write_uint32(&cmd[i], addr);
    write_uint32(&cmd[i + 4], data);
    stlink_fill_native_ap_tail(sl, cmd, i + 8);
    size = send_recv(slu, 1, cmd, slu->cmd_len, rdata, rep_len, CMD_CHECK_RETRY, "WRITEDEBUGREG");

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_get_rw_status(stlink_t *sl) {
    if(sl->version.jtag_api == STLINK_JTAG_API_V1) { return (0); }

    unsigned char* const rdata = sl->q_buf;
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd  = sl->c_buf;
    int32_t i;
    int16_t ret = 0;

    i = fill_command(sl, SG_DXFER_FROM_DEV, 12);
    cmd[i++] = STLINK_DEBUG_COMMAND;

    if(sl->version.flags & STLINK_F_HAS_GETLASTRWSTATUS2) {
        cmd[i++] = STLINK_DEBUG_APIV2_GETLASTRWSTATUS2;
        ret = send_recv(slu, 1, cmd, slu->cmd_len, rdata, 12, CMD_CHECK_STATUS, "GETLASTRWSTATUS2");
    } else {
        cmd[i++] = STLINK_DEBUG_APIV2_GETLASTRWSTATUS;
        ret = send_recv(slu, 1, cmd, slu->cmd_len, rdata, 2, CMD_CHECK_STATUS, "GETLASTRWSTATUS");
    }

    return (ret < 0 ? -1 : 0);
}

static int32_t _stlink_usb_init_ap(stlink_t *sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const rdata = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    int32_t i;

    if(sl->version.jtag_api == STLINK_JTAG_API_V1 ||
        sl->target_ap == 0 ||
        sl->target_ap_inited) {
        return (0);
    }

    if(!(sl->version.flags & STLINK_F_HAS_AP_INIT) ||
        !(sl->version.flags & STLINK_F_HAS_DPBANKSEL)) {
        ELOG("ST-Link firmware does not support selecting access port %u\n", sl->target_ap);
        return (-1);
    }

    i = fill_command(sl, SG_DXFER_FROM_DEV, 2);
    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_APIV2_INIT_AP;
    cmd[i++] = sl->target_ap;
    stlink_fill_init_ap_args(sl, cmd, i);
    size = send_recv(slu, 1, cmd, slu->cmd_len, rdata, 2, CMD_CHECK_STATUS, "INIT_AP");

    if(size < 0) {
        return (-1);
    }

    sl->target_ap_inited = true;
    return (0);
}

int32_t _stlink_usb_write_mem32(stlink_t *sl, uint32_t addr, uint16_t len) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    int32_t i, ret;
    uint16_t off = 0;
    const uint16_t max_chunk = stlink_target_uses_ap(sl) ? 1024 : len;

    ret = _stlink_usb_init_ap(sl);
    if(ret == -1) { return (ret); }

    while(off < len) {
        uint16_t chunk = stlink_mem32_chunk_size(sl, addr + off, len - off, max_chunk);

        i = fill_command(sl, SG_DXFER_TO_DEV, chunk);
        cmd[i++] = STLINK_DEBUG_COMMAND;
        cmd[i++] = STLINK_DEBUG_WRITEMEM_32BIT;
        write_uint32(&cmd[i], addr + off);
        write_uint16(&cmd[i + 4], chunk);
        stlink_set_mem_ap_trailer(cmd, i + 6, sl);
        ret = send_only(slu, 0, cmd, slu->cmd_len, "WRITEMEM_32BIT");

        if(ret == -1) { return (ret); }

        ret = send_only(slu, 1, data + off, chunk, "WRITEMEM_32BIT");

        if(ret == -1) { return (ret); }

        ret = _stlink_usb_get_rw_status(sl);
        if(ret == -1) { return (ret); }

