STM32World/stlink/src/stlink-lib/usb.c
        off += chunk;
    }

    return (0);
}

int32_t _stlink_usb_write_mem8(stlink_t *sl, uint32_t addr, uint16_t len) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    int32_t i, ret;

    if((sl->version.jtag_api < STLINK_JTAG_API_V3 && len > 64) ||
        (sl->version.jtag_api >= STLINK_JTAG_API_V3 && len > 512)) {
        ELOG("WRITEMEM_8BIT: bulk packet limits exceeded (data len %d byte)\n", len);
        return (-1);
    }

    ret = _stlink_usb_init_ap(sl);
    if(ret == -1) { return (ret); }

    i = fill_command(sl, SG_DXFER_TO_DEV, 0);
    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_WRITEMEM_8BIT;
    write_uint32(&cmd[i], addr);
    write_uint16(&cmd[i + 4], len);
    stlink_set_mem_ap_trailer(cmd, i + 6, sl);
    ret = send_only(slu, 0, cmd, slu->cmd_len, "WRITEMEM_8BIT");

    if(ret == -1) { return (ret); }

    ret = send_only(slu, 1, data, len, "WRITEMEM_8BIT");

    if(ret == -1) { return (ret); }

    return (0);
}

int32_t _stlink_usb_current_mode(stlink_t * sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd  = sl->c_buf;
    unsigned char* const data = sl->q_buf;
    ssize_t size;
    int32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_GET_CURRENT_MODE;
    size = send_recv(slu, 1, cmd,  slu->cmd_len, data, rep_len, CMD_CHECK_NO, "GET_CURRENT_MODE");

    if(size < 0) {
        return (-1);
    }

    return (sl->q_buf[0]);
}

int32_t _stlink_usb_core_id(stlink_t * sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd  = sl->c_buf;
    unsigned char* const data = sl->q_buf;
    ssize_t size;
    int32_t offset, rep_len = sl->version.jtag_api == STLINK_JTAG_API_V1 ? 4 : 12;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;

    if(sl->version.jtag_api == STLINK_JTAG_API_V1) {
        cmd[i++] = STLINK_DEBUG_READCOREID;
        offset = 0;
    } else {
        cmd[i++] = STLINK_DEBUG_APIV2_READ_IDCODES;
        offset = 4;
    }

    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_STATUS, "READ_IDCODES");

    if(size < 0) {
        return (-1);
    }

    sl->core_id = read_uint32(data, offset);

    return (0);
}

int32_t _stlink_usb_status_v2(stlink_t *sl) {
    int32_t result;
    uint32_t status = 0;

    if(stlink_use_debug_access_router(sl)) {
        result = stlink_read_debug32(sl, STM32_REG_DHCSR, &status);
        if(result != 0 && sl->chip_id == STM32_CHIPID_H5xx && sl->target_ap != 0) {
            if(_stlink_usb_read_mem32(sl, STM32_REG_DHCSR, 4) == 0) {
                status = read_uint32(sl->q_buf, 0);
                result = 0;
            }
        }
    } else {
        result = _stlink_usb_read_debug32(sl, STM32_REG_DHCSR, &status);
    }
    DLOG("core status: %08X\n", status);

    if(result != 0) {
        sl->core_stat = TARGET_UNKNOWN;
    } else {
        if(status & STM32_REG_DHCSR_S_HALT) {
            sl->core_stat = TARGET_HALTED;
        } else if(status & STM32_REG_DHCSR_S_LOCKUP) {
            sl->core_stat = TARGET_UNKNOWN;
        } else if(status & STM32_REG_DHCSR_S_RESET_ST) {
            sl->core_stat = TARGET_RESET;
        } else {
            sl->core_stat = TARGET_RUNNING;
        }
    }

    return (result);
}

int32_t _stlink_usb_status(stlink_t * sl) {
    // Use _stlink_usb_status_v2() for STLINK_JTAG_API_V2 (and STLINK_JTAG_API_V3)
    if(sl->version.jtag_api != STLINK_JTAG_API_V1) { return (_stlink_usb_status_v2(sl)); }

    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    int32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_GETSTATUS;
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_NO, "GETSTATUS");

    if(size > 1) {
        if(sl->q_buf[0] == STLINK_CORE_RUNNING) {
            sl->core_stat = TARGET_RUNNING;
        } else if(sl->q_buf[0] == STLINK_CORE_HALTED) {
            sl->core_stat = TARGET_HALTED;
        } else {
            sl->core_stat = TARGET_UNKNOWN;
        }
    } else {
        sl->core_stat = TARGET_UNKNOWN;
    }

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_force_debug(stlink_t *sl) {
    struct stlink_libusb *slu = sl->backend_data;

    int32_t res;

    if(sl->version.jtag_api != STLINK_JTAG_API_V1) {
        if(stlink_use_debug_access_router(sl)) {
            res = stlink_write_debug32(sl, STM32_REG_DHCSR,
                                       STM32_REG_DHCSR_DBGKEY |
                                       STM32_REG_DHCSR_C_HALT |
                                       STM32_REG_DHCSR_C_DEBUGEN);
        } else {
            res = _stlink_usb_write_debug32(sl, STM32_REG_DHCSR,
                                            STM32_REG_DHCSR_DBGKEY |
                                            STM32_REG_DHCSR_C_HALT |
                                            STM32_REG_DHCSR_C_DEBUGEN);
        }
        return (res);
    }

    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    int32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_FORCEDEBUG;
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "FORCEDEBUG");

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_enter_swd_mode(stlink_t * sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    unsigned char* const data = sl->q_buf;
    const uint32_t rep_len = sl->version.jtag_api == STLINK_JTAG_API_V1 ? 0 : 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    // select correct API-Version for entering SWD mode: V1 API (0x20), V2 API (0x30) or V3 API (0x??)
    if(sl->version.jtag_api == STLINK_JTAG_API_V1) {
        cmd[i++] = STLINK_DEBUG_APIV1_ENTER;
    } else if(sl->version.jtag_api == STLINK_JTAG_API_V2) {
        cmd[i++] = STLINK_DEBUG_APIV2_ENTER;
    } else {
        // STLINK_JTAG_API_V3
        cmd[i++] = STLINK_DEBUG_APIV2_ENTER;
    }

    cmd[i++] = STLINK_DEBUG_ENTER_SWD;
    stlink_fill_enter_swd_ap_args(sl, cmd, i);
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "ENTER_SWD");

    if(size >= 0 && !stlink_h5_uses_ap(sl)) {
        stlink_invalidate_ap_session(sl);
    }

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_exit_dfu_mode(stlink_t* sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, 0);

    cmd[i++] = STLINK_DFU_COMMAND;
    cmd[i++] = STLINK_DFU_EXIT;
    size = send_only(slu, 1, cmd, slu->cmd_len, "DFU_EXIT");

    return (size < 0 ? -1 : 0);
}


