STM32World/stlink/src/stlink-lib/usb.c
int32_t _stlink_usb_reset(stlink_t * sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t i, rep_len = 2;

    // send reset command
    i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);
    cmd[i++] = STLINK_DEBUG_COMMAND;

    if(sl->version.jtag_api == STLINK_JTAG_API_V1) {
        cmd[i++] = STLINK_DEBUG_APIV1_RESETSYS;
    } else if(sl->version.jtag_api == STLINK_JTAG_API_V2){
        cmd[i++] = STLINK_DEBUG_APIV2_RESETSYS;
    } else {
        // STLINK_JTAG_API_V3;
        cmd[i++] = STLINK_DEBUG_APIV2_RESETSYS;
    }

    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "RESETSYS");

    if(size >= 0 && !stlink_h5_uses_ap(sl)) {
        stlink_invalidate_ap_session(sl);
    }

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_jtag_reset(stlink_t * sl, int32_t value) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_APIV2_DRIVE_NRST;
    cmd[i++] = value;
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "DRIVE_NRST");

    if(size >= 0 && !stlink_h5_uses_ap(sl)) {
        stlink_invalidate_ap_session(sl);
    }

    return (size < 0 ? -1 : 0);
}


int32_t _stlink_usb_step(stlink_t* sl) {
    struct stlink_libusb * const slu = sl->backend_data;

    if(sl->version.jtag_api != STLINK_JTAG_API_V1) {
        // emulates the JTAG v1 API by using DHCSR
        int32_t (*write_debug32_fn)(stlink_t *, uint32_t, uint32_t) =
            stlink_use_debug_access_router(sl) ? stlink_write_debug32 : _stlink_usb_write_debug32;
        write_debug32_fn(sl, STM32_REG_DHCSR, STM32_REG_DHCSR_DBGKEY | STM32_REG_DHCSR_C_HALT |
                                              STM32_REG_DHCSR_C_MASKINTS | STM32_REG_DHCSR_C_DEBUGEN);
        write_debug32_fn(sl, STM32_REG_DHCSR, STM32_REG_DHCSR_DBGKEY | STM32_REG_DHCSR_C_STEP |
                                              STM32_REG_DHCSR_C_MASKINTS | STM32_REG_DHCSR_C_DEBUGEN);
        return write_debug32_fn(sl, STM32_REG_DHCSR, STM32_REG_DHCSR_DBGKEY | STM32_REG_DHCSR_C_HALT |
                                                     STM32_REG_DHCSR_C_DEBUGEN);
    }

    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_STEPCORE;
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "STEPCORE");

    return (size < 0 ? -1 : 0);
}

/**
 * This seems to do a good job of restarting things from the beginning?
 * @param sl
 * @param type
 */
int32_t _stlink_usb_run(stlink_t* sl, enum run_type type) {
    struct stlink_libusb * const slu = sl->backend_data;

    int32_t res;

    if(sl->version.jtag_api != STLINK_JTAG_API_V1) {
        if(stlink_use_debug_access_router(sl)) {
            res = stlink_write_debug32(sl, STM32_REG_DHCSR,
                                       STM32_REG_DHCSR_DBGKEY |
                                       STM32_REG_DHCSR_C_DEBUGEN |
                                       ((type == RUN_FLASH_LOADER) ?
                                           STM32_REG_DHCSR_C_MASKINTS :
                                           0));
        } else {
            res = _stlink_usb_write_debug32(sl, STM32_REG_DHCSR,
                                            STM32_REG_DHCSR_DBGKEY |
                                            STM32_REG_DHCSR_C_DEBUGEN |
                                            ((type == RUN_FLASH_LOADER) ?
                                                STM32_REG_DHCSR_C_MASKINTS :
                                                0));
        }
        return (res);
    }


    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_RUNCORE;
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "RUNCORE");

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_set_swdclk(stlink_t* sl, int32_t clk_freq) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t rep_len = 2;
    int32_t i;

    // clock speed only supported by stlink/v2 and for firmware >= 22
    if(sl->version.stlink_v == 2 && sl->version.jtag_v >= 22) {
        uint16_t clk_divisor;
        if(clk_freq) {
            const uint32_t map[] = {5, 15, 25, 50, 100, 125, 240, 480, 950, 1200, 1800, 4000};
            int32_t speed_index = _stlink_match_speed_map(map, STLINK_ARRAY_SIZE(map), clk_freq);
            switch (map[speed_index]) {
            case 5:   clk_divisor = STLINK_SWDCLK_5KHZ_DIVISOR; break;
            case 15:  clk_divisor = STLINK_SWDCLK_15KHZ_DIVISOR; break;
            case 25:  clk_divisor = STLINK_SWDCLK_25KHZ_DIVISOR; break;
            case 50:  clk_divisor = STLINK_SWDCLK_50KHZ_DIVISOR; break;
            case 100: clk_divisor = STLINK_SWDCLK_100KHZ_DIVISOR; break;
            case 125: clk_divisor = STLINK_SWDCLK_125KHZ_DIVISOR; break;
            case 240: clk_divisor = STLINK_SWDCLK_240KHZ_DIVISOR; break;
            case 480: clk_divisor = STLINK_SWDCLK_480KHZ_DIVISOR; break;
            case 950: clk_divisor = STLINK_SWDCLK_950KHZ_DIVISOR; break;
            case 1200: clk_divisor = STLINK_SWDCLK_1P2MHZ_DIVISOR; break;
            default:
            case 1800: clk_divisor = STLINK_SWDCLK_1P8MHZ_DIVISOR; break;
            case 4000: clk_divisor = STLINK_SWDCLK_4MHZ_DIVISOR; break;
            }
        } else { clk_divisor = STLINK_SWDCLK_1P8MHZ_DIVISOR; }

        i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

        cmd[i++] = STLINK_DEBUG_COMMAND;
        cmd[i++] = STLINK_DEBUG_APIV2_SWD_SET_FREQ;
        cmd[i++] = clk_divisor & 0xFF;
        cmd[i++] = (clk_divisor >> 8) & 0xFF;
        size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "SWD_SET_FREQ");

        return (size < 0 ? -1 : 0);

    } else if(sl->version.stlink_v == 3) {
        int32_t speed_index;
        uint32_t map[STLINK_V3_MAX_FREQ_NB];
        i = fill_command(sl, SG_DXFER_FROM_DEV, 16);

        cmd[i++] = STLINK_DEBUG_COMMAND;
        cmd[i++] = STLINK_DEBUG_APIV3_GET_COM_FREQ;
        cmd[i++] = 0; // SWD mode
        size = send_recv(slu, 1, cmd, slu->cmd_len, data, 52, CMD_CHECK_STATUS, "GET_COM_FREQ");

        if(size < 0) { return (-1); }

