STM32World/stlink/src/stlink-lib/usb.c
        int32_t speeds_size = data[8];
        if(speeds_size > STLINK_V3_MAX_FREQ_NB) {
            speeds_size = STLINK_V3_MAX_FREQ_NB;
        }

        for(i = 0; i < speeds_size; i++) map[i] = le_to_h_u32(&data[12 + 4 * i]);

        // Set to zero all the next entries
        for(i = speeds_size; i < STLINK_V3_MAX_FREQ_NB; i++) map[i] = 0;

        if(!clk_freq) clk_freq = 1000; // set default frequency
        speed_index = _stlink_match_speed_map(map, STLINK_ARRAY_SIZE(map), clk_freq);

        i = fill_command(sl, SG_DXFER_FROM_DEV, 16);

        cmd[i++] = STLINK_DEBUG_COMMAND;
        cmd[i++] = STLINK_DEBUG_APIV3_SET_COM_FREQ;
        cmd[i++] = 0; // SWD mode
        cmd[i++] = 0;
        cmd[i++] = (uint8_t) ((map[speed_index] >> 0) & 0xFF);
        cmd[i++] = (uint8_t) ((map[speed_index] >> 8) & 0xFF);
        cmd[i++] = (uint8_t) ((map[speed_index] >> 16) & 0xFF);
        cmd[i++] = (uint8_t) ((map[speed_index] >> 24) & 0xFF);

        size = send_recv(slu, 1, cmd, slu->cmd_len, data, 8, CMD_CHECK_STATUS, "SET_COM_FREQ");

        return (size < 0 ? -1 : 0);

    } else if(clk_freq) {
        WLOG("ST-Link firmware does not support frequency setup\n");
    }

    return (-1);
}

int32_t _stlink_usb_exit_debug_mode(stlink_t *sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, 0);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_EXIT;

    size = send_only(slu, 1, cmd, slu->cmd_len, "DEBUG_EXIT");

    if(size >= 0 && !stlink_h5_uses_ap(sl)) {
        stlink_invalidate_ap_session(sl);
    }

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_read_mem32(stlink_t *sl, uint32_t addr, uint16_t len) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd = sl->c_buf;
    ssize_t size;
    int32_t ret;
    int32_t i;
    uint16_t off = 0;
    const uint16_t max_chunk = stlink_target_uses_ap(sl) ? 1024 : len;

    ret = _stlink_usb_init_ap(sl);
    if(ret == -1) { return (ret); }

    while(off < len) {
        uint16_t chunk = stlink_mem32_chunk_size(sl, addr + off, len - off, max_chunk);

        i = fill_command(sl, SG_DXFER_FROM_DEV, chunk);

        cmd[i++] = STLINK_DEBUG_COMMAND;
        cmd[i++] = STLINK_DEBUG_READMEM_32BIT;
        write_uint32(&cmd[i], addr + off);
        write_uint16(&cmd[i + 4], chunk);
        stlink_set_mem_ap_trailer(cmd, i + 6, sl);
        size = send_recv(slu, 1, cmd, slu->cmd_len, data + off, chunk, CMD_CHECK_NO, "READMEM_32BIT");

        if(size < 0) {
            return (-1);
        }

        if(chunk > 4 && !stlink_h5_is_verify_read(sl, addr + off, chunk)) {
            ret = _stlink_usb_get_rw_status(sl);
            if(ret == -1) {
                return (-1);
            }
        }

        off += chunk;
    }

    sl->q_len = len;
    stlink_print_data(sl);

    return (0);
}

int32_t _stlink_usb_read_all_regs(stlink_t *sl, struct stlink_reg *regp) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const cmd = sl->c_buf;
    unsigned char* const data = sl->q_buf;
    ssize_t size;
    uint32_t rep_len = sl->version.jtag_api == STLINK_JTAG_API_V1 ? 84 : 88;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;

    if(sl->version.jtag_api == STLINK_JTAG_API_V1) {
        cmd[i++] = STLINK_DEBUG_APIV1_READALLREGS;
    } else if(sl->version.jtag_api == STLINK_JTAG_API_V2) {
        cmd[i++] = STLINK_DEBUG_APIV2_READALLREGS;
    } else {
        // STLINK_JTAG_API_V3
        cmd[i++] = STLINK_DEBUG_APIV2_READALLREGS;
    }

    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_STATUS, "READALLREGS");

    if(size < 0) {
        return (-1);
    }

    /* V1: regs data from offset 0 */
    /* V2: status at offset 0, regs data from offset 4 */
    int32_t reg_offset = sl->version.jtag_api == STLINK_JTAG_API_V1 ? 0 : 4;
    sl->q_len = (int32_t) size;
    stlink_print_data(sl);

    for(i = 0; i < 16; i++) regp->r[i] = read_uint32(sl->q_buf, reg_offset + i * 4);

    regp->xpsr       = read_uint32(sl->q_buf, reg_offset + 64);
    regp->main_sp    = read_uint32(sl->q_buf, reg_offset + 68);
    regp->process_sp = read_uint32(sl->q_buf, reg_offset + 72);
    regp->rw         = read_uint32(sl->q_buf, reg_offset + 76);
    regp->rw2        = read_uint32(sl->q_buf, reg_offset + 80);

    if(sl->verbose < 2) { return (0); }

    DLOG("xpsr       = 0x%08x\n", regp->xpsr);
    DLOG("main_sp    = 0x%08x\n", regp->main_sp);
    DLOG("process_sp = 0x%08x\n", regp->process_sp);
    DLOG("rw         = 0x%08x\n", regp->rw);
    DLOG("rw2        = 0x%08x\n", regp->rw2);

    return (0);
}

int32_t _stlink_usb_read_reg(stlink_t *sl, int32_t r_idx, struct stlink_reg *regp) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    uint32_t r;
    uint32_t rep_len = sl->version.jtag_api == STLINK_JTAG_API_V1 ? 4 : 8;
    int32_t reg_offset = sl->version.jtag_api == STLINK_JTAG_API_V1 ? 0 : 4;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    if(_stlink_usb_init_ap(sl) == -1) {
        return (-1);
    }

    i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;

    if(sl->version.jtag_api == STLINK_JTAG_API_V1) {
        cmd[i++] = STLINK_DEBUG_APIV1_READREG;
    } else if(sl->version.jtag_api == STLINK_JTAG_API_V2) {
        cmd[i++] = STLINK_DEBUG_APIV2_READREG;
    } else {
        // STLINK_JTAG_API_V3
        cmd[i++] = STLINK_DEBUG_APIV2_READREG;
    }

    cmd[i++] = (uint8_t) r_idx;
    stlink_fill_native_ap_tail(sl, cmd, i);
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "READREG");

    if(size < 0) {
        return (-1);
    }

    sl->q_len = (int32_t) size;
    stlink_print_data(sl);
    r = read_uint32(sl->q_buf, reg_offset);
    DLOG("r_idx (%2d) = 0x%08x\n", r_idx, r);

    switch (r_idx) {
    case 16:
        regp->xpsr = r;
        break;
    case 17:
        regp->main_sp = r;
        break;
    case 18:
        regp->process_sp = r;
        break;
    case 19:
        regp->rw = r; // XXX ?(primask, basemask etc.)
        break;
    case 20:
        regp->rw2 = r; // XXX ?(primask, basemask etc.)
        break;
    default:
        regp->r[r_idx] = r;
    }

    return (0);
}

/* See section C1.6 of the ARMv7-M Architecture Reference Manual */
int32_t _stlink_usb_read_unsupported_reg(stlink_t *sl, int32_t r_idx, struct stlink_reg *regp) {
    uint32_t r;
    int32_t ret;

    sl->q_buf[0] = (unsigned char)r_idx;

    for(int32_t i = 1; i < 4; i++) sl->q_buf[i] = 0;

