STM32World/stlink/src/stlink-lib/usb.c
    ret = _stlink_usb_write_mem32(sl, STM32_REG_DCRSR, 4);

    if(ret == -1) { return (ret); }

    ret = _stlink_usb_read_mem32(sl, STM32_REG_DCRDR, 4);

    if(ret == -1) { return (ret); }

    r = read_uint32(sl->q_buf, 0);
    DLOG("r_idx (%2d) = 0x%08x\n", r_idx, r);

    switch (r_idx) {
    case 0x14:
        regp->primask = (uint8_t) (r & 0xFF);
        regp->basepri = (uint8_t) ((r >> 8) & 0xFF);
        regp->faultmask = (uint8_t) ((r >> 16) & 0xFF);
        regp->control = (uint8_t) ((r >> 24) & 0xFF);
        break;
    case 0x21:
        regp->fpscr = r;
        break;
    default:
        regp->s[r_idx - 0x40] = r;
        break;
    }

    return (0);
}

int32_t _stlink_usb_read_all_unsupported_regs(stlink_t *sl, struct stlink_reg *regp) {
    int32_t ret;

    ret = _stlink_usb_read_unsupported_reg(sl, 0x14, regp);

    if(ret == -1) { return (ret); }

    ret = _stlink_usb_read_unsupported_reg(sl, 0x21, regp);

    if(ret == -1) { return (ret); }

    for(int32_t i = 0; i < 32; i++) {
        ret = _stlink_usb_read_unsupported_reg(sl, 0x40 + i, regp);

        if(ret == -1) { return (ret); }
    }

    return (0);
}

/* See section C1.6 of the ARMv7-M Architecture Reference Manual */
int32_t _stlink_usb_write_unsupported_reg(stlink_t *sl, uint32_t val, int32_t r_idx, struct stlink_reg *regp) {
    int32_t ret;

    if(r_idx >= 0x1C && r_idx <= 0x1F) { // primask, basepri, faultmask, or control
        /* These are held in the same register */
        ret = _stlink_usb_read_unsupported_reg(sl, 0x14, regp);

        if(ret == -1) { return (ret); }

        val = (uint8_t) (val >> 24);

        switch (r_idx) {
        case 0x1C: /* control */
            val = (((uint32_t) val) << 24) |
                  (((uint32_t) regp->faultmask) << 16) |
                  (((uint32_t) regp->basepri) << 8) |
                  ((uint32_t) regp->primask);
            break;
        case 0x1D: /* faultmask */
            val = (((uint32_t) regp->control) << 24) |
                  (((uint32_t) val) << 16) |
                  (((uint32_t) regp->basepri) << 8) |
                  ((uint32_t) regp->primask);
            break;
        case 0x1E: /* basepri */
            val = (((uint32_t) regp->control) << 24) |
                  (((uint32_t) regp->faultmask) << 16) |
                  (((uint32_t) val) << 8) |
                  ((uint32_t) regp->primask);
            break;
        case 0x1F: /* primask */
            val = (((uint32_t) regp->control) << 24) |
                  (((uint32_t) regp->faultmask) << 16) |
                  (((uint32_t) regp->basepri) << 8) |
                  ((uint32_t) val);
            break;
        }

        r_idx = 0x14;
    }

    write_uint32(sl->q_buf, val);

    ret = _stlink_usb_write_mem32(sl, STM32_REG_DCRDR, 4);

    if(ret == -1) { return (ret); }

    sl->q_buf[0] = (unsigned char)r_idx;
    sl->q_buf[1] = 0;
    sl->q_buf[2] = 0x01;
    sl->q_buf[3] = 0;

    return (_stlink_usb_write_mem32(sl, STM32_REG_DCRSR, 4));
}

int32_t _stlink_usb_write_reg(stlink_t *sl, uint32_t reg, int32_t idx) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    uint32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    if(_stlink_usb_init_ap(sl) == -1) {
        return (-1);
    }

    i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;

    if(sl->version.jtag_api == STLINK_JTAG_API_V1) {
        cmd[i++] = STLINK_DEBUG_APIV1_WRITEREG;
    } else if(sl->version.jtag_api == STLINK_JTAG_API_V2) {
        cmd[i++] = STLINK_DEBUG_APIV2_WRITEREG;
    } else {
        // STLINK_JTAG_API_V3
        cmd[i++] = STLINK_DEBUG_APIV2_WRITEREG;
    }

    cmd[i++] = idx;
    write_uint32(&cmd[i], reg);
    stlink_fill_native_ap_tail(sl, cmd, i + 4);
    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_RETRY, "WRITEREG");

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_enable_trace(stlink_t* sl, uint32_t frequency) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    uint32_t rep_len = 2;
    uint32_t max_trace_buf_len = 0;
    
    if(sl->version.stlink_v == 2) {
        max_trace_buf_len = STLINK_V2_TRACE_BUF_LEN;
    } else if(sl->version.stlink_v == 3) {
        max_trace_buf_len = STLINK_V3_TRACE_BUF_LEN;
    };

    int32_t i = fill_command(sl, SG_DXFER_TO_DEV, rep_len);
    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_APIV2_START_TRACE_RX;
    write_uint16(&cmd[i + 0], 2 * max_trace_buf_len);
    write_uint32(&cmd[i + 2], frequency);

    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_STATUS, "START_TRACE_RX");

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_disable_trace(stlink_t* sl) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    ssize_t size;
    uint32_t rep_len = 2;

    int32_t i = fill_command(sl, SG_DXFER_TO_DEV, rep_len);
    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_APIV2_STOP_TRACE_RX;

    size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_STATUS, "STOP_TRACE_RX");

    return (size < 0 ? -1 : 0);
}

int32_t _stlink_usb_read_trace(stlink_t* sl, uint8_t* buf, uint32_t size) {
    struct stlink_libusb * const slu = sl->backend_data;
    unsigned char* const data = sl->q_buf;
    unsigned char* const cmd  = sl->c_buf;
    uint32_t rep_len = 2;
    int32_t i = fill_command(sl, SG_DXFER_FROM_DEV, rep_len);

    cmd[i++] = STLINK_DEBUG_COMMAND;
    cmd[i++] = STLINK_DEBUG_APIV2_GET_TRACE_NB;
    ssize_t send_size = send_recv(slu, 1, cmd, slu->cmd_len, data, rep_len, CMD_CHECK_NO, "GET_TRACE_NB");

    if(send_size < 0) {
        return (-1);
    } else if(send_size != 2) {
        ELOG("STLINK_DEBUG_APIV2_GET_TRACE_NB reply size %d\n", (int32_t) send_size);
        return (-1);
    }

    uint16_t trace_count = read_uint16(sl->q_buf, 0);

    if(trace_count > size) {
        ELOG("read_trace insufficient buffer length\n");
        return -1;
    }

    if(trace_count != 0) {
        int32_t res = 0;
        int32_t t = libusb_bulk_transfer(slu->usb_handle, slu->ep_trace, buf, trace_count, &res, 3000);

