STM32World/stlink/src/stlink-lib/usb.c
        if(t || res != (int32_t) trace_count) {
            ELOG("read_trace read error %d\n", t);
            return (-1);
        }
    }

    return trace_count;
}

static stlink_backend_t _stlink_usb_backend = {
    _stlink_usb_close,
    _stlink_usb_exit_debug_mode,
    _stlink_usb_enter_swd_mode,
    NULL, // don't enter_jtag_mode here...
    _stlink_usb_exit_dfu_mode,
    _stlink_usb_core_id,
    _stlink_usb_reset,
    _stlink_usb_jtag_reset,
    _stlink_usb_run,
    _stlink_usb_status,
    _stlink_usb_version,
    _stlink_usb_read_debug32,
    _stlink_usb_read_mem32,
    _stlink_usb_write_debug32,
    _stlink_usb_write_mem32,
    _stlink_usb_write_mem8,
    _stlink_usb_read_all_regs,
    _stlink_usb_read_reg,
    _stlink_usb_read_all_unsupported_regs,
    _stlink_usb_read_unsupported_reg,
    _stlink_usb_write_unsupported_reg,
    _stlink_usb_write_reg,
    _stlink_usb_step,
    _stlink_usb_current_mode,
    _stlink_usb_force_debug,
    _stlink_usb_target_voltage,
    _stlink_usb_set_swdclk,
    _stlink_usb_enable_trace,
    _stlink_usb_disable_trace,
    _stlink_usb_read_trace
};

/* return the length of serial or (0) in case of errors */
uint32_t stlink_serial(struct libusb_device_handle *handle, struct libusb_device_descriptor *desc, char *serial) {
    unsigned char desc_serial[(STLINK_SERIAL_LENGTH) * 2];

    /* truncate the string in the serial buffer */
    serial[0] = '\0';

    /* get the LANGID from String Descriptor Zero */
    int32_t ret = libusb_get_string_descriptor(handle, 0, 0, desc_serial, sizeof(desc_serial));
    if(ret < 4) return 0;

    uint32_t langid = desc_serial[2] | (desc_serial[3] << 8);

    /* get the serial */
    ret = libusb_get_string_descriptor(handle, desc->iSerialNumber, langid, desc_serial,
        sizeof(desc_serial));
    if(ret < 0) return 0; // could not read serial

    unsigned char len = desc_serial[0];

    if(len == ((STLINK_SERIAL_LENGTH + 1) * 2)) { /* len == 50 */
        /* good ST-Link adapter */
        ret = libusb_get_string_descriptor_ascii(
            handle, desc->iSerialNumber, (unsigned char *)serial, STLINK_SERIAL_BUFFER_SIZE);
        if(ret < 0) return 0;
    } else if(len == ((STLINK_SERIAL_LENGTH / 2 + 1) * 2)) { /* len == 26 */
        /* fix-up the buggy serial */
        for(uint32_t i = 0; i < STLINK_SERIAL_LENGTH; i += 2)
            sprintf(serial + i, "%02X", desc_serial[i + 2]);
        serial[STLINK_SERIAL_LENGTH] = '\0';
    } else {
        return 0;
    }

    return (uint32_t)strlen(serial);
}

/**
 * Open a stlink
 * @param verbose Verbosity loglevel
 * @param connect Type of connect to target
 * @param serial  Serial number to search for, when NULL the first stlink found is opened (binary format)
 * @retval NULL   Error while opening the stlink
 * @retval !NULL  Stlink found and ready to use
 */
stlink_t *stlink_open_usb(enum ugly_loglevel verbose, enum connect_type connect,
                          char serial[STLINK_SERIAL_BUFFER_SIZE], int32_t freq) {
    stlink_t* sl = NULL;
    struct stlink_libusb* slu = NULL;
    int32_t ret = -1;
    int32_t config;

    sl = calloc(1, sizeof(stlink_t));
    if(sl == NULL) { goto on_malloc_error; }

    slu = calloc(1, sizeof(struct stlink_libusb));
    if(slu == NULL) { goto on_malloc_error; }

    ugly_init(verbose);
    sl->backend = &_stlink_usb_backend;
    sl->backend_data = slu;

    sl->core_stat = TARGET_UNKNOWN;

    if(libusb_init(&(slu->libusb_ctx))) {
        WLOG("failed to init libusb context, wrong version of libraries?\n");
        goto on_error;
    }

#if LIBUSB_API_VERSION < 0x01000106
    libusb_set_debug(slu->libusb_ctx, ugly_libusb_log_level(verbose));
#else
    libusb_set_option(slu->libusb_ctx, LIBUSB_OPTION_LOG_LEVEL, ugly_libusb_log_level(verbose));
#endif

    libusb_device **list = NULL;
    ssize_t cnt = libusb_get_device_list(slu->libusb_ctx, &list);
    struct libusb_device_descriptor desc;

    while (cnt-- > 0) {
        struct libusb_device_handle *handle;

        libusb_get_device_descriptor(list[cnt], &desc);

        if(desc.idVendor != STLINK_USB_VID_ST) { continue; }

        ret = libusb_open(list[cnt], &handle);

        if(ret) { continue; } // could not open device

        uint64_t serial_len = stlink_serial(handle, &desc, sl->serial);

        libusb_close(handle);

        if(serial_len != STLINK_SERIAL_LENGTH) { continue; } // could not read the serial

        // if no serial provided, or if serial match device, fixup version and protocol
        if(((serial == NULL) || (*serial == 0)) || (memcmp(serial, &sl->serial, STLINK_SERIAL_LENGTH) == 0)) {
            if(STLINK_V1_USB_PID(desc.idProduct)) {
                slu->protocol = 1;
                sl->version.stlink_v = 1;
            } else if(STLINK_V2_USB_PID(desc.idProduct) || STLINK_V2_1_USB_PID(desc.idProduct)) {
                sl->version.stlink_v = 2;
            } else if(STLINK_V3_USB_PID(desc.idProduct)) {
                sl->version.stlink_v = 3;
            }

            break;
        }
    }

    if(cnt < 0) {
        WLOG ("Couldn't find any ST-Link devices\n");
        libusb_free_device_list(list, 1);
        goto on_error;
    } else {
        ret = libusb_open(list[cnt], &slu->usb_handle);

        if(ret != 0) {
            WLOG("Error %d (%s) opening ST-Link v%d device %03d:%03d\n", ret,
                 strerror(errno),
                 sl->version.stlink_v,
                 libusb_get_bus_number(list[cnt]),
                 libusb_get_device_address(list[cnt]));
            libusb_free_device_list(list, 1);
            goto on_error;
        }
    }

    libusb_free_device_list(list, 1);

// libusb_kernel_driver_active is not available on Windows.
#if !defined(_WIN32)
    if(libusb_kernel_driver_active(slu->usb_handle, 0) == 1) {
        ret = libusb_detach_kernel_driver(slu->usb_handle, 0);

        if(ret < 0) {
            WLOG("libusb_detach_kernel_driver(() error %s\n", strerror(-ret));
            goto on_libusb_error;
        }
    }
#endif // NOT _WIN32

    if(libusb_get_configuration(slu->usb_handle, &config)) {
        // this may fail for a previous configured device
        WLOG("libusb_get_configuration()\n");
        goto on_libusb_error;
    }

    if(config != 1) {
        printf("setting new configuration (%d -> 1)\n", config);

        if(libusb_set_configuration(slu->usb_handle, 1)) {
            // this may fail for a previous configured device
            WLOG("libusb_set_configuration() failed\n");
            goto on_libusb_error;
        }
    }

    if(libusb_claim_interface(slu->usb_handle, 0)) {
        WLOG("Stlink usb device found, but unable to claim (probably already in use?)\n");
        goto on_libusb_error;
    }

