STM32World/stlink/src/stlink-lib/usb.c
    // TODO: Could use the scanning technique from STM8 code here...
    slu->ep_rep = 1 /* ep rep */ | LIBUSB_ENDPOINT_IN;

    if(desc.idProduct == STLINK_USB_PID_STLINK_NUCLEO ||
        desc.idProduct == STLINK_USB_PID_STLINK_32L_AUDIO ||
        desc.idProduct == STLINK_USB_PID_STLINK_V2_1 ||
        desc.idProduct == STLINK_USB_PID_STLINK_V3_USBLOADER ||
        desc.idProduct == STLINK_USB_PID_STLINK_V3E_PID ||
        desc.idProduct == STLINK_USB_PID_STLINK_V3S_PID ||
        desc.idProduct == STLINK_USB_PID_STLINK_V3_2VCP_PID ||
        desc.idProduct == STLINK_USB_PID_STLINK_V3_NO_MSD_PID ||
        desc.idProduct == STLINK_USB_PID_STLINK_V3P) {
        slu->ep_req = 1 /* ep req */ | LIBUSB_ENDPOINT_OUT;
        slu->ep_trace = 2 | LIBUSB_ENDPOINT_IN;
    } else {
        slu->ep_req = 2 /* ep req */ | LIBUSB_ENDPOINT_OUT;
        slu->ep_trace = 3 | LIBUSB_ENDPOINT_IN;
    }

    slu->sg_transfer_idx = 0;
    slu->cmd_len = (slu->protocol == 1) ? STLINK_SG_SIZE : STLINK_CMD_SIZE;

    // initialize stlink version (sl->version)
    stlink_version(sl);

    int32_t mode = stlink_current_mode(sl);
    if(mode == STLINK_DEV_DFU_MODE) {
        DLOG("-- exit_dfu_mode\n");
        _stlink_usb_exit_dfu_mode(sl);
    }

    if(connect == CONNECT_UNDER_RESET) {
        // for the connect under reset only
        // OpenOСD says (official documentation is not available) that
        // the NRST pin must be pull down before selecting the SWD/JTAG mode
        if(mode == STLINK_DEV_DEBUG_MODE) {
            DLOG("-- exit_debug_mode\n");
            _stlink_usb_exit_debug_mode(sl);
        }

        _stlink_usb_jtag_reset(sl, STLINK_DEBUG_APIV2_DRIVE_NRST_LOW);
    }

    sl->freq = freq;
    // set the speed before entering the mode as the chip discovery phase
    // should be done at this speed too
    // set the stlink clock speed (default is 1800 kHz)
    DLOG("JTAG/SWD freq set to %d\n", freq);
    _stlink_usb_set_swdclk(sl, freq);

    stlink_target_connect(sl, connect);
    return (sl);

on_libusb_error:
    stlink_close(sl);
    return (NULL);

on_error:
    if(slu->libusb_ctx) { libusb_exit(slu->libusb_ctx); }

on_malloc_error:
    if(sl != NULL) { free(sl); }
    if(slu != NULL) { free(slu); }

    return (NULL);
}

static uint32_t stlink_probe_usb_devs(libusb_device **devs, stlink_t **sldevs[], enum connect_type connect, int32_t freq) {
    stlink_t **_sldevs;
    libusb_device *dev;
    int32_t i = 0;
    uint32_t slcnt = 0;
    uint32_t slcur = 0;

    /* Count STLINKs */
    while ((dev = devs[i++]) != NULL) {
        struct libusb_device_descriptor desc;
        int32_t ret = libusb_get_device_descriptor(dev, &desc);

        if(ret < 0) {
            WLOG("failed to get libusb device descriptor (libusb error: %d)\n", ret);
            break;
        }

        if(desc.idVendor != STLINK_USB_VID_ST) { continue; }

        if(!STLINK_SUPPORTED_USB_PID(desc.idProduct)) {
            WLOG("skipping ST device : %#04x:%#04x)\n", desc.idVendor, desc.idProduct);
            continue;
        }

        slcnt++;
    }

    _sldevs = calloc(slcnt, sizeof(stlink_t *)); // allocate list of pointers

    if(!_sldevs) {
        *sldevs = NULL;
        return (0);
    }

    /* Open STLINKS and attach them to list */
    i = 0;

    while ((dev = devs[i++]) != NULL) {
        struct libusb_device_descriptor desc;
        int32_t ret = libusb_get_device_descriptor(dev, &desc);

        if(ret < 0) {
            WLOG("failed to get libusb device descriptor (libusb error: %d)\n", ret);
            break;
        }

        if(!STLINK_SUPPORTED_USB_PID(desc.idProduct)) { continue; }

        struct libusb_device_handle* handle;
        char serial[STLINK_SERIAL_BUFFER_SIZE] = {0, };

        ret = libusb_open(dev, &handle);

        if(ret < 0) {
            if(ret == LIBUSB_ERROR_ACCESS) {
                ELOG("Could not open USB device %#06x:%#06x, access error.\n", desc.idVendor, desc.idProduct);
            } else {
                ELOG("Failed to open USB device %#06x:%#06x, libusb error: %d)\n", desc.idVendor, desc.idProduct, ret);
            }

            break;
        }

        uint64_t serial_len = stlink_serial(handle, &desc, serial);

        libusb_close(handle);

        if(serial_len != STLINK_SERIAL_LENGTH) { continue; }

        stlink_t *sl = stlink_open_usb(0, connect, serial, freq);

        if(!sl) {
            ELOG("Failed to open USB device %#06x:%#06x\n", desc.idVendor, desc.idProduct);
            continue;
        }

        _sldevs[slcur++] = sl;
    }

    *sldevs = _sldevs;

    return (slcur);
}

uint32_t stlink_probe_usb(stlink_t **stdevs[], enum connect_type connect, int32_t freq) {
    libusb_device **devs;
    stlink_t **sldevs;

    uint32_t slcnt = 0;
    int32_t r;
    ssize_t cnt;

    r = libusb_init(NULL);

    if(r < 0) { return (0); }

    cnt = libusb_get_device_list(NULL, &devs);

    if(cnt < 0) { return (0); }

    slcnt = stlink_probe_usb_devs(devs, &sldevs, connect, freq);
    libusb_free_device_list(devs, 1);

    libusb_exit(NULL);

    *stdevs = sldevs;

    return (slcnt);
}

void stlink_probe_usb_free(stlink_t ***stdevs, uint32_t size) {
    if(stdevs == NULL || *stdevs == NULL || size == 0) { return; }

    for(uint32_t n = 0; n < size; n++) { stlink_close((*stdevs)[n]); }

    free(*stdevs);
    *stdevs = NULL;
}
